<html>
<head><title>Auf Magnettonband gespeicherte Dateien laden</title></head>
<body>
 <h1>Tipps &amp; Tricks</h1>

 <h2>Auf Magnettonband gespeicherte Dateien laden</h2>

 <h3>Vorbemerkungen</h3>
  Um auf Magnettonband gespeicherte Dateien laden zu k&ouml;nnen,
  m&uuml;ssen diese in einer entsprechend guten Qualit&auml;t
  vom Band wiedergegeben werden k&ouml;nnen.
  Das ist nat&uuml;rlich um so schwieriger,
  je &auml;lter die Aufnahmen sind,
  denn die Qualit&auml;t l&auml;sst im Laufe der Zeit nach.
  Das wiederum kann zu Fehlern beim Wiedereinlesen f&uuml;hren.
  Sie sollten deshalb Geduld mitbringen
  und nicht gleich beim ersten Fehlversuch aufgeben.
 <br/><br/>

 <h3>Voraussetzungen</h3>
  <ol>
   <li>
    Sie m&uuml;ssen das Magnettonbandger&auml;t (z.B. Kassettenrecorder)
    an die Line-In- oder Mikrofonbuchse 
    des Emulatorrechners anschlie&szlig;en.
   </li>
   <li>
    Sie ben&ouml;tigen im Emulator eine Software,
    die das Format lesen kann,
    mit dem die Dateien auf dem Magnettonband gespeichert wurden.
    Die im JKCEMU vorhandenen Betriebssysteme bzw. Monitorprogramme
    bieten die M&ouml;glichkeit, im jeweiligen Standardformat
    gespeicherte Maschinencodeprogramme zu laden.
   </li>
  </ol>
 <br/><br/>

 <h3>Vorgehensweise</h3>
  <ol>
   <li>
    Schlie&szlig;en Sie das Magnettonbandger&auml;t an die Line-In- oder
    falls diese nicht vorhanden oder der Signalpegel zu gering ist
    an die Mikrofonbuchse des Emulator-Computers an.
    Entsprechende Kabel und Adapter finden Sie im Fachhandel.
   </li>
   <li>
    Stellen Sie mit der Lautst&auml;rkeregelung oder einem Mixer sicher,
    dass die Wiedergabe des Magnettonbandger&auml;tes im Emulatorrechner
    leicht &uuml;bersteuert zu h&ouml;ren ist.
   </li>
   <li>
    Geben Sie im Emulator den Befehl zum Laden der Datei ein,
    dr&uuml;cken aber noch nicht auf <em>ENTER</em>.
   </li>
   <li>
    Aktivieren Sie die Funktion
    <a href="../audio.htm#data_in">Audiodaten vom Sound-System lesen</a>.
   </li>
   <li>Starten Sie am Magnettonbandger&auml;t die Wiedergabe.</li>
   <li>
    Sobald Sie den Synchronisationston am Anfang der zu ladenden Datei
    h&ouml;ren, bet&auml;tigen Sie die <em>ENTER</em>-Taste.
    Damit beginnt das eigentliche Laden.
   </li>
   <li>
    Nachdem die Datei geladen wurde,
    deaktivieren Sie die Audiofunktion und speichern am besten gleich
    den gerade geladenen Adressbereich.
   </li>
  </ol>
 <br/><br/>

 <h3>Hinweise bei Lesefehlern</h3>
  Sollte das Laden Probleme bereiten, probieren Sie die folgenden Tipps aus:
  <ul>
   <li>
    &Uuml;berpr&uuml;fen Sie, ob die Audiodaten auch wirklich
    am Emulator ankommen (siehe Pegelanzeige im Fenster
    <em>Audio/Kassette</em>).
    Erh&ouml;hen Sie dazu mit der Lautst&auml;rkeregelung oder
    einem Mixer den Eingangspegel des Line-In- beziehungsweise
    des Mikrofoneingangs.
    Das Eingangssignal sollte leicht bis deutlich &uuml;bersteuert sein.
   </li>
   <li>
    &Uuml;berpr&uuml;fen Sie, ob die in den
    <a href="../settings.htm">Einstellungen</a>
    angegebene Emulationsgeschwindigkeit gleich der ist,
    mit der die Datei auf dem Band gespeichert wurde.
   </li>
   <li>
    Schalten Sie zwischen dem linken und dem rechten Kanal um,
    insbesondere dann, wenn das Band in einem Stereo-Kassettenrecorder
    wiedergegeben wird.
   </li>
   <li>
    Schlie&szlig;en Sie das Magnettonbandger&auml;t an einen anderen
    Audioeingang an (z.B. zwischen Line-In- und Mikrofonbuchse
    wechseln).
   </li>
   <li>
    &Auml;ndern Sie die Geschwindigkeit des Emulators auf einen
    etwa 10 bis 20 Prozent niedrigeren oder h&ouml;heren Wert.
    Das ist vorallem dann sinnvoll, wenn das Ladeprogramm
    den Synchronisationston und damit schon den ersten Block
    nicht erkennt.
    M&ouml;glicherweise unterscheidet sich die Wiedergabegeschwindigkeit
    zu sehr von der Geschwindigkeit, mit der das Band bespielt wurde.
   </li>
   <li>Probieren Sie verschiedene Abtastraten aus.</li>
  </ul>
 <br/><br/>
  Sollten diese Hinweise zu keinem Erfolg f&uuml;hren,
  kann ein echter Computer gute Dienste leisten:
  <ol>
   <li>
    Laden Sie die Datei zuerst in den echten Computer.
    Aufgrund der anderen Hardware sind die Erfolgsaussichten besser.
   </li>
   <li>
    Schlie&szlig;en Sie diesen Computer an den Audioeingang
    des Emulatorrechners an.
   </li>
   <li>Starten Sie im Emulator das Laden, so wie oben beschrieben.</li>
   <li>
    Speichern Sie auf dem angeschlossenen Computer die Datei,
    so dass die Daten direkt an den Emulatorrechner &uuml;bertragen
    werden.
   </li>
  </ol>
 <br/><br/>
  Eine andere M&ouml;glichkeit besteht darin,
  die Datei auf dem Magnettonbandger&auml;t abzuspielen
  und mit Hilfe der Betriebssystemmittel als Sound-Datei aufzunehmen.
  Anschlie&szlig;end lesen Sie diese Sound-Datei im JKCEMU ein
  (siehe auch <a href="readsoundfile.htm">In einer Sound-Datei
  enthaltenes Programm laden</a>
  Diese Vorgehensweise ist vorallem dann sinnvoll,
  wenn die Rechenleitung nicht ausreicht,
  um beim Einlesen die Emulationsgeschwindigkeit aufrecht zu erhalten.
  Das ist dann der Fall, wenn die in der Statuszeile angezeigte
  emulierte Taktfrequenz wesentlich unter der in den Einstellungen
  angegebenen liegt.
</body>
</html>
